# TODO Найдите количество книг, которое можно разместить на дискете
book = 100   # Количество страниц
page = 50    # Число строк
line = 25   # Количество символов в строке
byt = 4    # Количество байт для одного символа
disk = 1.44  # Объем дискеты в Мб

total = book * page * line  # Общее количество символов в книге
diskbytes = disk * 1024 * 1024  # Перевод объема дискеты в байты
bookbytes = total * byt  # Размер книги в байтах
num_books = diskbytes // bookbytes  # Целочисленное деление
# Вывод результата
print("Количество книг, помещающихся на дискету:", num_books)
