salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
months = 10  # Количество месяцев, которое планируется протянуть без долгов
increase = 0.03  # Ежемесячный рост цен
money_capital = 0  # Инициализация переменной для необходимой подушки безопасности
for month in range(months):  # Проходим по каждому месяцу
    if month > 0:  # Со второго месяца и далее
        spend *= (1 + increase)
    deficit = spend - salary   # Определяем нехватку средств
    if deficit > 0:  # Если есть нехватка средств, добавляем ее к подушке безопасности
        money_capital += deficit
money_capital = round(money_capital)  # до целого
print(f"Подушка безопасности, чтобы протянуть {months} месяцев без долгов: {money_capital}")
