money_capital = 20000  # Подушка безопасности
salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
increase = 0.05  # Ежемесячный рост цен
months = 0  # Переменная для хранения количества месяцев
while money_capital + salary >= spend:  # Цикл, который будет выполняться, пока есть деньги
    months += 1              # Увеличиваем счетчик месяцев
    money_capital += salary   # Добавляем зарплату к подушке
    money_capital -= spend    # Вычитаем расходы
    spend *= (1 + increase)    # Увеличиваем расходы на 5%
print("Количество месяцев, которое можно протянуть без долгов:", months)
